apps/backend/jmeter/Database Testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Database Testing">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Database Test Plan">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="poolMax">0</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <boolProp name="preinit">false</boolProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dbUrl">jdbc:postgresql://localhost:5432/summer_project</stringProp>
          <stringProp name="driver">org.postgresql.Driver</stringProp>
          <stringProp name="username">riin_kaljurand</stringProp>
          <stringProp name="password">May2024</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 1)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM users WHERE email = ?</stringProp>
          <stringProp name="queryArguments">riinkaljurand@gmail.com</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 2)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM restaurant_recommender_restaurant WHERE restaurant_name = &apos;Sample Restaurant&apos;;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 3)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query"> SELECT a.* FROM restaurant_recommender_aspect a JOIN restaurant_recommender_restaurant r ON a.restaurant_id = r.id WHERE r.restaurant_name = &apos;Hortus NCY&apos;;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 4)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT r.restaurant_name, r.primary_cuisine, r.overall_rating, COUNT(a.id) AS aspect_count FROM restaurant_recommender_restaurant r JOIN restaurant_recommender_aspect a ON r.id = a.restaurant_id GROUP BY r.restaurant_name, r.primary_cuisine, r.overall_rating HAVING COUNT(a.id) &gt; 10;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 5)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT p.model_name, p.description, r.restaurant_name FROM restaurant_recommender_predictionmodel p JOIN restaurant_recommender_restaurant r ON p.restaurant_id = r.id WHERE p.is_active = TRUE;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 6)">
          <stringProp name="dataSource">Postgres_Connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM restaurant_recommender_weatherdata WHERE timestamp BETWEEN &apos;2024-07-01&apos; AND &apos;2024-07-31&apos;;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 7)">
          <stringProp name="dataSource">Postrges_connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT u.email, u.first_name, u.surname, p.first_name AS profile_first_name, p.surname AS profile_surname
FROM user_management u
LEFT JOIN user_profile p ON u.id = p.user_id
WHERE u.email = &apos;riinkaljurand@gmail.com&apos;;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 8)">
          <stringProp name="dataSource">Postrges_connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT b.id, r.restaurant_name
FROM bookmark b
JOIN bookmark_restaurants br ON b.id = br.bookmark_id
JOIN restaurant_recommender_restaurant r ON br.restaurant_id = r.id
WHERE b.user_id = (SELECT id FROM user_management WHERE email = &apos;riinkaljurand@gmail.com&apos;);
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 9)">
          <stringProp name="dataSource">Postrges_connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT u.email, u.first_name, COUNT(b.id) AS bookmark_count
FROM user_management u
JOIN bookmark b ON u.id = b.user_id
GROUP BY u.email, u.first_name
HAVING COUNT(b.id) &gt; 1;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 10)">
          <stringProp name="dataSource">Postrges_connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT cu.name, cu.email, cu.subject, cu.message, cu.created_at
FROM contact_us cu
JOIN user_management u ON cu.user_id = u.id
WHERE u.email = &apos;riinkaljurand@gmail.com&apos;;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request (Task 11)">
          <stringProp name="dataSource">Postrges_connection</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT u.email, r.restaurant_name
FROM bookmark b
JOIN user_management u ON b.user_id = u.id
JOIN bookmark_restaurants br ON b.id = br.bookmark_id
JOIN restaurant_recommender_restaurant r ON br.restaurant_id = r.id;
</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>